{"author":[],"actions":[],"created_at":"2021-03-10T15:00:05.800Z","updated_at":"2021-03-10T17:41:25.014Z","created_by":"A002191","description":"Identifies remote execution of Windows services over remote procedure call (RPC). This could be indicative of lateral\nmovement, but will be noisy if commonly done by administrators.\"","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"f2e3b378-cac6-4378-a76a-ea83cf031174","immutable":false,"index":["logs-*"],"interval":"5m","rule_id":"7bced3cd-fcf8-4a7e-9c1c-234127e95981","language":"eql","license":"","output_index":".siem-signals-a41-siem","max_signals":100,"risk_score":47,"risk_score_mapping":[],"name":"Remotely Started Services via RPC","query":"sequence with maxspan=1s\n   [network where process.name : \"services.exe\" and\n      network.direction == \"incoming\" and network.transport == \"tcp\" and \n      source.port >= 49152 and destination.port >= 49152 and not (source.address:\"127.0.0.1\" or source.address:\"::1\")\n   ] by host.id, process.entity_id\n   [process where (event.type:\"start\" or event.type:\"process_started\") and process.parent.name : \"services.exe\" and \n       not (process.name : \"svchost.exe\" and process.args : \"tiledatamodelsvc\") and \n       not (process.name : \"msiexec.exe\" and process.args : \"/V\")\n   \n    /* uncomment if psexec is noisy in your environment */\n    /* and not process.name : \"PSEXESVC.exe\" */\n   ] by host.id, process.parent.entity_id","references":[],"meta":{"from":"1m","kibana_siem_app_url":"https://mgtala301.a41mgt.local:5601/s/a41-siem/app/security"},"severity":"medium","severity_mapping":[],"updated_by":"A002191","tags":["Backport-HAFNIUM"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":1,"exceptions_list":[]}
{"author":[],"actions":[],"created_at":"2021-03-10T14:45:00.410Z","updated_at":"2021-03-10T17:41:25.011Z","created_by":"A002191","description":"Identifies the use of the Exchange PowerShell cmdlet, New-MailBoxExportRequest, to export the contents of a primary\nmailbox or archive to a .pst file. Adversaries may target user email to collect sensitive information.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"29c2e456-f0d6-4560-a33a-4e6e50d8a85c","immutable":false,"index":["logs-*"],"interval":"5m","rule_id":"e6cbc881-da43-45d4-9730-57c00692dc1a","language":"eql","license":"","output_index":".siem-signals-a41-siem","max_signals":100,"risk_score":47,"risk_score_mapping":[],"name":"Exporting Exchange Mailbox via PowerShell","query":"process where (event.type:\"start\" or event.type: \"process_started\") and\n  (process.name: \"powershell.exe\" or process.name:\"pwsh.exe\") and process.args : \"New-MailboxExportRequest*\"","references":[],"meta":{"from":"1m","kibana_siem_app_url":"https://mgtala301.a41mgt.local:5601/s/a41-siem/app/security"},"severity":"medium","severity_mapping":[],"updated_by":"A002191","tags":["Backport-HAFNIUM"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":2,"exceptions_list":[]}
{"author":[],"actions":[],"created_at":"2021-03-10T14:52:01.106Z","updated_at":"2021-03-10T17:43:42.032Z","created_by":"A002191","description":"Adversaries may implement command and control communications that use common web services in order to hide their\nactivity. This attack technique is typically targeted to an organization and uses web services common to the victim\nnetwork which allows the adversary to blend into legitimate traffic. activity. These popular services are typically\ntargeted since they have most likely been used before a compromise and allow adversaries to blend in the network.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"ce158a9d-abf3-46d4-b268-76efa7409759","immutable":false,"index":["logs-*"],"interval":"5m","rule_id":"04b5ce95-129b-46e2-9d1a-1fc207ea16a1","language":"eql","license":"","output_index":".siem-signals-a41-siem","max_signals":100,"risk_score":21,"risk_score_mapping":[],"name":"Connection to Commonly Abused Web Services","query":"network where network.protocol == \"dns\" and\n    /* Add new WebSvc domains here */\n    (\n        dns.question.name :\"*.githubusercontent.*\" or\n        dns.question.name :\"*.pastebin.*\" or\n        dns.question.name :\"*drive.google.*\" or\n        dns.question.name :\"*docs.live.*\" or\n        dns.question.name :\"*api.dropboxapi.*\" or\n        dns.question.name :\"*dropboxusercontent.*\" or\n        dns.question.name :\"*onedrive.*\" or\n        dns.question.name :\"*4shared.*\" or\n        dns.question.name :\"*.file.io\" or\n        dns.question.name :\"*filebin.net\" or\n        dns.question.name :\"*slack-files.com\" or\n        dns.question.name :\"*ghostbin.*\" or\n        dns.question.name :\"*ngrok.*\" or\n        dns.question.name :\"*portmap.*\" or\n        dns.question.name :\"*serveo.net\" or\n        dns.question.name :\"*localtunnel.me\" or\n        dns.question.name :\"*pagekite.me\" or\n        dns.question.name :\"*localxpose.io\" or\n        dns.question.name :\"*notabug.org\"\n    ) and\n    /* Insert noisy false positives here */\n    \n    (\n        not process.name :\"MicrosoftEdgeCP.exe\" and\n        not process.name :\"MicrosoftEdge.exe\" and\n        not process.name :\"iexplore.exe\" and\n        not process.name :\"chrome.exe\" and\n        not process.name :\"msedge.exe\" and\n        not process.name :\"opera.exe\" and\n        not process.name :\"firefox.exe\" and\n        not process.name :\"Dropbox.exe\" and\n        not process.name :\"slack.exe\" and\n        not process.name :\"svchost.exe\" and\n        not process.name :\"thunderbird.exe\" and\n        not process.name :\"outlook.exe\" and\n        not process.name :\"OneDrive.exe\"\n    )","references":[],"meta":{"from":"1m","kibana_siem_app_url":"https://mgtala301.a41mgt.local:5601/s/a41-siem/app/security"},"severity":"low","severity_mapping":[],"updated_by":"A002191","tags":["Backport-HAFNIUM"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":2,"exceptions_list":[]}
{"author":[],"actions":[],"created_at":"2021-03-10T15:08:14.334Z","updated_at":"2021-03-10T17:39:49.864Z","created_by":"A002191","description":"Identifies suspicious files being written by the Microsoft Exchange Server Unified Messaging (UM) service. This activity\nhas been observed exploiting CVE-2021-26858.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"8dd46f0d-e7e2-4022-9409-b3c06a8341ce","immutable":false,"index":["logs-*"],"interval":"5m","rule_id":"09076860-d53b-4119-a533-43b636db5eba","language":"eql","license":"","output_index":".siem-signals-a41-siem","max_signals":100,"risk_score":47,"risk_score_mapping":[],"name":"Microsoft Exchange Server UM Writing Suspicious Files","query":"file where event.type == \"creation\" and\n  (process.parent.name:\"UMWorkerProcess.exe\" or process.parent.name:\"umservice.exe\") and\n  (file.extension:\"php\" or file.extension:\"jsp\" or file.extension:\"js\" or file.extension:\"aspx\" or file.extension:\"asmx\" or file.extension:\"asax\" or file.extension:\"cfm\" or file.extension:\"shtml\") and\n  (\n    (file.path:\"C:\\\\inetpub\\\\wwwroot\\\\aspnet_client\\\\*\" or\n                 file.path:\"C:\\\\*\\\\FrontEnd\\\\HttpProxy\\\\owa\\\\auth\\\\*\") or\n    (file.path : \"C:\\\\*\\\\FrontEnd\\\\HttpProxy\\\\ecp\\\\auth\\\\*\" and not file.name : \"TimeoutLogoff.aspx\")\n  )","references":[],"meta":{"from":"1m","kibana_siem_app_url":"https://mgtala301.a41mgt.local:5601/s/a41-siem/app/security"},"severity":"medium","severity_mapping":[],"updated_by":"A002191","tags":["Backport-HAFNIUM"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":1,"exceptions_list":[]}
{"author":[],"actions":[],"created_at":"2021-03-10T14:56:12.772Z","updated_at":"2021-03-10T17:43:08.987Z","created_by":"A002191","description":"Identifies use of WinRar or 7z to create an encrypted files. Adversaries will often compress and encrypt data in\npreparation for exfiltration.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"9ca8615f-ad20-4da8-aac6-d562ff075c19","immutable":false,"index":["logs-*"],"interval":"5m","rule_id":"26486e15-634d-4aad-b335-5931990baa06","language":"eql","license":"","output_index":".siem-signals-a41-siem","max_signals":100,"risk_score":47,"risk_score_mapping":[],"name":"Encrypting Files with WinRar or 7z","query":"process where (event.type:\"start\" or event.type:\"process_started\") and\n  ((process.name:\"rar.exe\" or process.code_signature.subject_name == \"win.rar GmbH\" or\n      process.pe.original_file_name == \"Command line RAR\") and\n    process.args == \"a\" and (process.args:\"-hp*\" or process.args:\"-p*\" or process.args:\"-dw\" or process.args:\"-tb\" or process.args:\"-ta\" or process.args:\"/hp*\" or process.args:\"/p*\" or process.args:\"/dw\" or process.args:\"/tb\" or process.args:\"/ta\"))\n  or\n  (process.pe.original_file_name:\"7z.exe\" or process.pe.original_file_name:\"7za.exe\") and\n     process.args == \"a\" and (process.args:\"-p*\" or process.args:\"-sdel\")\n  /* uncomment if noisy for backup software related FPs */\n  /* not (process.parent.executable:\"C:\\\\Program Files\\\\*.exe\" or process.parent.executable:\"C:\\\\Program Files (x86)\\\\*.exe\") */","references":[],"meta":{"from":"1m","kibana_siem_app_url":"https://mgtala301.a41mgt.local:5601/s/a41-siem/app/security"},"severity":"medium","severity_mapping":[],"updated_by":"A002191","tags":["Backport-HAFNIUM"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":1,"exceptions_list":[]}
{"author":[],"actions":[],"created_at":"2021-03-10T14:48:04.540Z","updated_at":"2021-03-10T17:40:02.117Z","created_by":"A002191","description":"Identifies the execution of known Windows utilities often abused to dump LSASS memory or the Active Directory database\n(NTDS.dit) in preparation for credential access.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"023e52f9-1555-4cc5-9dc6-c04401d631fb","immutable":false,"index":["logs-*"],"interval":"5m","rule_id":"9278bbf3-c25f-4001-9901-556f088de8e5","language":"eql","license":"","output_index":".siem-signals-a41-siem","max_signals":100,"risk_score":73,"risk_score_mapping":[],"name":"Potential Credential Access via Windows Utilities","query":"process where (event.type: \"start\" or event.type: \"process_started\") and\n/* update here with any new lolbas with dump capability */\n(process.pe.original_file_name == \"procdump\" and process.args : \"-ma\") or\n(process.name : \"ProcessDump.exe\" and not process.parent.executable : \"C:\\\\Program Files*\\\\Cisco Systems\\\\*.exe\") or\n(process.pe.original_file_name == \"WriteMiniDump.exe\" and not process.parent.executable : \"C:\\\\Program Files*\\\\Steam\\\\*.exe\") or\n(process.pe.original_file_name == \"RUNDLL32.EXE\" and (process.args : \"MiniDump*\" or process.command_line : \"*comsvcs.dll*#24*\")) or\n(process.pe.original_file_name == \"RdrLeakDiag.exe\" and process.args : \"/fullmemdmp\") or\n(process.pe.original_file_name == \"SqlDumper.exe\" and process.args : \"0x01100*\") or\n(process.pe.original_file_name == \"TTTracer.exe\" and process.args : \"-dumpFull\" and process.args : \"-attach\") or\n(process.pe.original_file_name == \"ntdsutil.exe\" and process.args : \"create*full*\") or\n(process.pe.original_file_name == \"diskshadow.exe\" and process.args : \"/s\")","references":[],"meta":{"from":"1m","kibana_siem_app_url":"https://mgtala301.a41mgt.local:5601/s/a41-siem/app/security"},"severity":"high","severity_mapping":[],"updated_by":"A002191","tags":["Backport-HAFNIUM"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":2,"exceptions_list":[]}
{"author":[],"actions":[],"created_at":"2021-03-10T15:05:31.552Z","updated_at":"2021-03-10T17:42:21.867Z","created_by":"A002191","description":"Identifies suspicious processes being spawned by the Microsoft Exchange Server Unified Messaging (UM) service. This\nactivity has been observed exploiting CVE-2021-26857.","enabled":true,"false_positives":[],"filters":[],"from":"now-360s","id":"90d9907e-59c0-490f-a85f-be9bc72b58e3","immutable":false,"index":["logs-*"],"interval":"5m","rule_id":"2ec77e24-2f6c-4ca6-bd55-6eaf84b13b96","language":"eql","license":"","output_index":".siem-signals-a41-siem","max_signals":100,"risk_score":47,"risk_score_mapping":[],"name":"Microsoft Exchange Server UM Spawning Suspicious Processes","query":"process where event.type == \"start\" and\n  (process.parent.name:\"UMService.exe\" or process.parent.name:\"UMWorkerProcess.exe\") and\n    not (process.name:\"werfault.exe\" or process.name:\"wermgr.exe\")","references":[],"meta":{"from":"1m","kibana_siem_app_url":"https://mgtala301.a41mgt.local:5601/s/a41-siem/app/security"},"severity":"medium","severity_mapping":[],"updated_by":"A002191","tags":["Backport-HAFNIUM"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":1,"exceptions_list":[]}
{"exported_count":7,"missing_rules":[],"missing_rules_count":0}
